package mainpackage;

public class DeleteUnwantedChars {

	public DeleteUnwantedChars() {
		// String input = "Źbflmpsvz řčšěÁďťň◙$`ľNžŽ2356";
		String input2 = "Kikkoman :;<>@_:{}~×´˝ˇ§÷°˙ Sójová äàáâbßčçćdďéèêëěfghíîïĺľňñńóöôŕřśštťüúůýźžÄÀÁÂČÇĆDĎÉÈÊËĚÍÎÏĹĽŇÑŃÓÖÔŔŘŚŠŤÜÚŮÝŹŽ!/„“”#., omáčka se [(sníženým obsahem)>] +-* soli 150ml/20 Kč ? %&#";
		// String regexKeep="[^a-zA-Z0-9\\säàáâbßčçćdďéèêëěfghíîïĺľňñńóöôŕřśštťüúůýźžÄÀÁÂČÇĆDĎÉÈÊËĚÍÎÏĹĽŇÑŃÓÖÔŔŘŚŠŤÜÚŮÝŹŽ!„“”#.,?%&’()[]*+-/\\:;<>@_:{}~×´˝ˇ§÷°˙\\"]";
		// String regexKeep2="[^a-zA-Z0-9\\säàáâbßčçćdďéèêëěfghíîïĺľňñńóöôŕřśštťüúůýźžÄÀÁÂČÇĆDĎÉÈÊËĚÍÎÏĹĽŇÑŃÓÖÔŔŘŚŠŤÜÚŮÝŹŽ!/\\„“”#.,\\?\\%\\&\\’\\(\\)\\[\\]*+-0123456789:;<>@_:{}~×´˝ˇ§÷°˙]";
		// „“”#.,?%&’()[]*+-/\\:;<>@_:{}~×´˝ˇ§÷°˙\\"
		// String regexDelete = "[☺☻♥♦5♠•◘○◙♂♀♪♫☼►◄↕‼¶§▬↨↑↓→←∟↔▲▼Ź■()<{}~ ⌂âä łîĽľ Ą ĂĂă ŃńňŔŕŰ`´'­˝˛ˇ÷¸°¨˙ , ]";

		/* =============================================================================================================================================================================== */
		String regexKeep2 = "[^a-zA-Z0-9\\säàáâßčçćďéèêëěíîïĺľňñńóöôŕřśšťüúůýźžÄÀÁÂČÇĆDĎÉÈÊËĚÍÎÏĹĽŇÑŃÓÖÔŔŘŚŠŤÜÚŮÝŹŽ!/„“”#.,\\?\\%\\&\\’\\(\\)\\[\\]*+-0123456789:;<>@_:{}~×´˝ˇ§÷°˙]";
		/* =============================================================================================================================================================================== */

		// String output = input.replaceAll(regexKeep2, "");

		// System.out.println(" input=" + input + "|");
		// System.out.println("output=" + output + "|");

		String output2 = input2.replaceAll(regexKeep2, "");
		System.out.println(" input2=" + input2 + "|");
		System.out.println("output2=" + output2 + "|");

	}

}
